app/controllers/course/events_controller.rb

INSERT INTO "course_events" ("created_at", "end_date", "master_id", "start_date", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 27 Dec 2013 14:33:42 GMT +00:00], ["end_date", Tue, 31 Dec 2013], ["master_id", 1], ["start_date", Tue, 10 Dec 2013], ["updated_at", Fri, 27 Dec 2013 14:33:42 GMT +00:00]]
---
  def create
    @course_event = Course::Event.new(course_event_params)

    respond_to do |format|
      if @course_event.save