app/controllers/course/event_candidates_controller.rb

    def set_course_event_candidate
      @course_event_candidate = Course::EventCandidate.find(params[:id])
---
SELECT "course_event_candidates".* FROM "course_event_candidates" WHERE "course_event_candidates"."event_id" = ?  [["event_id", 4]]