app/controllers/course/masters_controller.rb

INSERT INTO "course_masters" ("code", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["code", ""], ["created_at", Mon, 23 Dec 2013 14:08:52 UTC +00:00], ["title", ""], ["updated_at", Mon, 23 Dec 2013 14:08:52 UTC +00:00]]
---
  def create
    @course = Course::Master.new(course_params)

    respond_to do |format|
      if @course.save