app/views/course/masters/show.html.erb

SELECT "course_events".* FROM "course_events" WHERE "course_events"."master_id" = ?  [["master_id", 1]]
SELECT 1 AS one FROM "course_events" WHERE "course_events"."master_id" = ? LIMIT 1  [["master_id", 1]]
---
        </tr>
        <% if @course.course_events.any? %>